Config/Documents/ТабельУчетаПосещаемостиДетейСКорректировкой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТабельУчетаПосещаемостиДетейСКорректировкой</Name>
			<BasedOn>
				<xr:Item>Document.ТабельУчетаПосещаемостиДетейСКорректировкой</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТабельУчетаПосещаемостиДетейСКорректировкой</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейВМесяце</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРабочихДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскаяПлатаДопУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТабеля</Name>
					<Comment>0 - по дням, 1 - сводно</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаПосещаемостиДетейСКорректировкой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОПосещениях</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ребенок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля1</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля2</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля3</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля4</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля5</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля6</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля7</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля8</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля9</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля10</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля11</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля12</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля13</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля14</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля15</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля16</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля17</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля18</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля19</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля20</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля21</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля22</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля23</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля24</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля25</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля26</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля27</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля28</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля29</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля30</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписиТабеля31</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписейТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоПосещений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплНевыходы</Name>
							<Comment>Количество оплачиваемых невыходов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеоплНевыходы</Name>
							<Comment>Количество неоплачиваемых невыходов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричиныНепосещения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ТабельУчетаПосещаемостиДетейСКорректировкой/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТабельУчетаПосещаемостиДетейСКорректировкой") Тогда 
		
		// Это исправление существующего табеля.
		// В таком случае сторнируются все записи по старому табелю, и формируются новые.
		// Ввод корректировочного табеля возможен только на основании проведенного документа.
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			СтандартнаяОбработка = Ложь;
			ТекстОшибки = НСтр("ru='Ввести корректировочный табель можно только на основании проведенного документа. Ввод корректировки невозможен!'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Основание,Номер,Дата,Ответственный,ОтветственныйИсполнитель,Комментарий,Проведен");
		Основание = ДанныеЗаполнения;
		ДанныеОПосещениях.Загрузить(ДанныеЗаполнения.ДанныеОПосещениях.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ТабельУчетаПосещаемостиДетейСКорректировкой.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	// Движения по регистрам сведений
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "ТабельУчетаПосещаемостиДетейСКорректировкой");
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьВозможностьЗаписиДокумента(Отказ, РежимЗаписи, РежимПроведения);
	ПроверитьСуществующиеЗаписиТабеля(Отказ, РежимЗаписи, РежимПроведения);
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Основание = Документы.ТабельУчетаПосещаемостиДетейСКорректировкой.ПустаяСсылка();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьВозможностьЗаписиДокумента(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли; 
	
	ДействующийДокумент = РодительскаяПлата.ПолучитьКорректирующийТабельУчетаПосещаемости(Ссылка);
	
	Если ЗначениеЗаполнено(ДействующийДокумент) Тогда
		ТекстОшибки = НСтр("ru='Для выбранного табеля существует документ корректирующий документ. Изменение невозможно!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСуществующиеЗаписиТабеля(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли; 
	
	//ДействующийДокумент = РодительскаяПлата.ПолучитьКорректирующийТабельУчетаПосещаемости(Ссылка);
	//
	//Если ЗначениеЗаполнено(ДействующийДокумент) Тогда
	//	ТекстОшибки = НСтр("ru='Для выбранного табеля существует документ корректирующий документ. Изменение невозможно!'");
	//	ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,, Отказ);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
